testTesults/stage_4/4_delete_wrk.txt
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4.316ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.084ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.738ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 4.268ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.21ms   60.27ms   1.01s    99.06%
    Req/Sec     2.60k   792.34     9.00k    76.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.21ms
 75.000%    5.11ms
 90.000%   10.53ms
 99.000%   41.02ms
 99.900%  929.79ms
 99.990%    1.00s 
 99.999%    1.01s 
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.058     0.000000            1         1.00
       0.579     0.100000        50045         1.11
       0.955     0.200000       100074         1.25
       1.252     0.300000       149999         1.43
       1.665     0.400000       200068         1.67
       2.215     0.500000       250075         2.00
       2.621     0.550000       274988         2.22
       3.079     0.600000       300026         2.50
       3.603     0.650000       324970         2.86
       4.267     0.700000       349999         3.33
       5.111     0.750000       375055         4.00
       5.615     0.775000       387514         4.44
       6.211     0.800000       399968         5.00
       6.931     0.825000       412525         5.71
       7.811     0.850000       424969         6.67
       8.975     0.875000       437479         8.00
       9.703     0.887500       443743         8.89
      10.535     0.900000       449992        10.00
      11.495     0.912500       456256        11.43
      12.575     0.925000       462461        13.33
      13.807     0.937500       468734        16.00
      14.487     0.943750       471853        17.78
      15.255     0.950000       474976        20.00
      16.087     0.956250       478091        22.86
      16.991     0.962500       481202        26.67
      18.063     0.968750       484339        32.00
      18.687     0.971875       485924        35.56
      19.391     0.975000       487471        40.00
      20.255     0.978125       489030        45.71
      21.311     0.981250       490587        53.33
      23.039     0.984375       492139        64.00
      24.639     0.985938       492922        71.11
      28.255     0.987500       493701        80.00
      34.207     0.989062       494482        91.43
      68.543     0.990625       495263       106.67
     224.639     0.992188       496045       128.00
     308.735     0.992969       496435       142.22
     400.383     0.993750       496826       160.00
     493.311     0.994531       497216       182.86
     574.463     0.995313       497607       213.33
     655.871     0.996094       498000       256.00
     708.607     0.996484       498193       284.44
     750.079     0.996875       498388       320.00
     769.535     0.997266       498584       365.71
     790.015     0.997656       498780       426.67
     835.583     0.998047       498975       512.00
     862.207     0.998242       499072       568.89
     883.711     0.998437       499170       640.00
     891.903     0.998633       499269       731.43
     903.679     0.998828       499366       853.33
     933.375     0.999023       499462      1024.00
     948.223     0.999121       499512      1137.78
     960.511     0.999219       499562      1280.00
     967.167     0.999316       499614      1462.86
     971.775     0.999414       499659      1706.67
     976.383     0.999512       499707      2048.00
     979.455     0.999561       499731      2275.56
     983.551     0.999609       499758      2560.00
     986.111     0.999658       499785      2925.71
     988.159     0.999707       499806      3413.33
     991.743     0.999756       499829      4096.00
     992.767     0.999780       499841      4551.11
     994.815     0.999805       499853      5120.00
     997.375     0.999829       499865      5851.43
     998.911     0.999854       499879      6826.67
     999.935     0.999878       499891      8192.00
    1000.959     0.999890       499900      9102.22
    1001.471     0.999902       499907     10240.00
    1001.983     0.999915       499917     11702.86
    1001.983     0.999927       499917     13653.33
    1002.495     0.999939       499925     16384.00
    1002.495     0.999945       499925     18204.44
    1003.007     0.999951       499930     20480.00
    1003.007     0.999957       499930     23405.71
    1003.519     0.999963       499934     27306.67
    1004.031     0.999969       499939     32768.00
    1004.031     0.999973       499939     36408.89
    1004.031     0.999976       499939     40960.00
    1004.543     0.999979       499943     46811.43
    1004.543     0.999982       499943     54613.33
    1004.543     0.999985       499943     65536.00
    1005.055     0.999986       499947     72817.78
    1005.055     0.999988       499947     81920.00
    1005.055     0.999989       499947     93622.86
    1005.055     0.999991       499947    109226.67
    1005.055     0.999992       499947    131072.00
    1005.055     0.999993       499947    145635.56
    1005.055     0.999994       499947    163840.00
    1005.567     0.999995       499950    187245.71
    1005.567     1.000000       499950          inf
#[Mean    =        9.207, StdDeviation   =       60.265]
#[Max     =     1005.056, Total count    =       499950]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599963 requests in 1.00m, 38.91MB read
Requests/sec:   9999.56
Transfer/sec:    664.03KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4.019ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 3.950ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.147ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.837ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.00ms   58.18ms   1.00s    99.05%
    Req/Sec     2.61k     0.92k   10.26k    76.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.92ms
 75.000%    4.82ms
 90.000%   10.77ms
 99.000%   50.53ms
 99.900%  908.80ms
 99.990%  994.82ms
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.056     0.000000            1         1.00
       0.538     0.100000        50057         1.11
       0.905     0.200000       100086         1.25
       1.149     0.300000       150091         1.43
       1.525     0.400000       200097         1.67
       1.924     0.500000       250021         2.00
       2.311     0.550000       274991         2.22
       2.767     0.600000       300030         2.50
       3.287     0.650000       325038         2.86
       3.941     0.700000       350010         3.33
       4.815     0.750000       375034         4.00
       5.355     0.775000       387463         4.44
       6.003     0.800000       400000         5.00
       6.775     0.825000       412479         5.71
       7.755     0.850000       424976         6.67
       9.063     0.875000       437511         8.00
       9.855     0.887500       443716         8.89
      10.775     0.900000       449944        10.00
      11.847     0.912500       456223        11.43
      13.063     0.925000       462440        13.33
      14.455     0.937500       468719        16.00
      15.215     0.943750       471829        17.78
      16.071     0.950000       474957        20.00
      17.023     0.956250       478075        22.86
      18.127     0.962500       481194        26.67
      19.487     0.968750       484319        32.00
      20.335     0.971875       485893        35.56
      21.343     0.975000       487447        40.00
      22.815     0.978125       489007        45.71
      25.007     0.981250       490569        53.33
      28.655     0.984375       492126        64.00
      31.519     0.985938       492905        71.11
      35.455     0.987500       493687        80.00
      42.239     0.989062       494468        91.43
      70.911     0.990625       495249       106.67
     232.191     0.992188       496030       128.00
     302.847     0.992969       496420       142.22
     387.583     0.993750       496811       160.00
     461.311     0.994531       497201       182.86
     552.447     0.995313       497592       213.33
     613.887     0.996094       497983       256.00
     657.407     0.996484       498178       284.44
     690.687     0.996875       498375       320.00
     732.159     0.997266       498568       365.71
     771.583     0.997656       498764       426.67
     808.447     0.998047       498960       512.00
     828.415     0.998242       499059       568.89
     850.943     0.998437       499154       640.00
     876.543     0.998633       499252       731.43
     898.559     0.998828       499351       853.33
     910.335     0.999023       499448      1024.00
     919.551     0.999121       499496      1137.78
     928.255     0.999219       499547      1280.00
     939.519     0.999316       499594      1462.86
     953.343     0.999414       499643      1706.67
     964.095     0.999512       499695      2048.00
     965.631     0.999561       499716      2275.56
     968.703     0.999609       499740      2560.00
     972.799     0.999658       499768      2925.71
     977.919     0.999707       499789      3413.33
     984.063     0.999756       499814      4096.00
     986.623     0.999780       499827      4551.11
     988.671     0.999805       499838      5120.00
     990.207     0.999829       499851      5851.43
     991.231     0.999854       499862      6826.67
     993.279     0.999878       499876      8192.00
     994.303     0.999890       499883      9102.22
     995.327     0.999902       499889     10240.00
     995.839     0.999915       499894     11702.86
     996.863     0.999927       499903     13653.33
     997.375     0.999939       499906     16384.00
     997.887     0.999945       499909     18204.44
     998.399     0.999951       499911     20480.00
     998.911     0.999957       499914     23405.71
     999.423     0.999963       499917     27306.67
     999.935     0.999969       499921     32768.00
    1000.447     0.999973       499923     36408.89
    1000.447     0.999976       499923     40960.00
    1000.959     0.999979       499926     46811.43
    1000.959     0.999982       499926     54613.33
    1001.471     0.999985       499929     65536.00
    1001.471     0.999986       499929     72817.78
    1001.471     0.999988       499929     81920.00
    1001.983     0.999989       499931     93622.86
    1001.983     0.999991       499931    109226.67
    1002.495     0.999992       499933    131072.00
    1002.495     0.999993       499933    145635.56
    1002.495     0.999994       499933    163840.00
    1002.495     0.999995       499933    187245.71
    1002.495     0.999995       499933    218453.33
    1003.007     0.999996       499935    262144.00
    1003.007     1.000000       499935          inf
#[Mean    =        9.004, StdDeviation   =       58.177]
#[Max     =     1002.496, Total count    =       499935]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599980 requests in 1.00m, 38.91MB read
Requests/sec:   9999.79
Transfer/sec:    664.05KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.642ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.622ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 3.592ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.398ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.51ms   58.25ms   1.00s    99.02%
    Req/Sec     2.64k     1.09k   10.12k    70.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.47ms
 75.000%    5.90ms
 90.000%   12.45ms
 99.000%   44.67ms
 99.900%  905.22ms
 99.990%  992.26ms
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.056     0.000000            3         1.00
       0.603     0.100000        50074         1.11
       0.980     0.200000       100025         1.25
       1.324     0.300000       150027         1.43
       1.763     0.400000       200064         1.67
       2.469     0.500000       250112         2.00
       2.921     0.550000       275079         2.22
       3.431     0.600000       300078         2.50
       4.061     0.650000       325046         2.86
       4.859     0.700000       350058         3.33
       5.899     0.750000       375054         4.00
       6.567     0.775000       387601         4.44
       7.367     0.800000       400075         5.00
       8.359     0.825000       412588         5.71
       9.543     0.850000       425048         6.67
      10.903     0.875000       437542         8.00
      11.655     0.887500       443847         8.89
      12.447     0.900000       450078        10.00
      13.287     0.912500       456318        11.43
      14.215     0.925000       462574        13.33
      15.231     0.937500       468806        16.00
      15.791     0.943750       471949        17.78
      16.375     0.950000       475046        20.00
      17.023     0.956250       478231        22.86
      17.759     0.962500       481338        26.67
      18.655     0.968750       484452        32.00
      19.199     0.971875       486028        35.56
      19.839     0.975000       487551        40.00
      20.735     0.978125       489130        45.71
      22.015     0.981250       490677        53.33
      24.735     0.984375       492239        64.00
      26.991     0.985938       493015        71.11
      29.919     0.987500       493797        80.00
      34.303     0.989062       494578        91.43
     108.991     0.990625       495359       106.67
     223.487     0.992188       496140       128.00
     300.287     0.992969       496532       142.22
     377.855     0.993750       496922       160.00
     460.799     0.994531       497313       182.86
     540.159     0.995313       497704       213.33
     612.863     0.996094       498094       256.00
     651.775     0.996484       498290       284.44
     691.199     0.996875       498490       320.00
     731.135     0.997266       498679       365.71
     785.919     0.997656       498875       426.67
     838.143     0.998047       499071       512.00
     868.351     0.998242       499168       568.89
     877.055     0.998437       499269       640.00
     883.711     0.998633       499370       731.43
     891.903     0.998828       499462       853.33
     906.239     0.999023       499559      1024.00
     915.455     0.999121       499607      1137.78
     930.303     0.999219       499657      1280.00
     938.495     0.999316       499707      1462.86
     947.711     0.999414       499755      1706.67
     955.903     0.999512       499806      2048.00
     958.463     0.999561       499828      2275.56
     964.095     0.999609       499854      2560.00
     968.191     0.999658       499876      2925.71
     973.311     0.999707       499903      3413.33
     977.919     0.999756       499924      4096.00
     981.503     0.999780       499938      4551.11
     984.575     0.999805       499952      5120.00
     986.111     0.999829       499962      5851.43
     988.671     0.999854       499973      6826.67
     991.231     0.999878       499987      8192.00
     992.255     0.999890       499996      9102.22
     992.767     0.999902       500000     10240.00
     994.303     0.999915       500005     11702.86
     995.839     0.999927       500010     13653.33
     996.863     0.999939       500016     16384.00
     997.375     0.999945       500020     18204.44
     997.887     0.999951       500024     20480.00
     998.399     0.999957       500027     23405.71
     998.911     0.999963       500030     27306.67
     999.423     0.999969       500033     32768.00
     999.423     0.999973       500033     36408.89
     999.935     0.999976       500037     40960.00
     999.935     0.999979       500037     46811.43
     999.935     0.999982       500037     54613.33
    1000.959     0.999985       500040     65536.00
    1000.959     0.999986       500040     72817.78
    1000.959     0.999988       500040     81920.00
    1001.471     0.999989       500042     93622.86
    1001.471     0.999991       500042    109226.67
    1001.983     0.999992       500044    131072.00
    1001.983     0.999993       500044    145635.56
    1001.983     0.999994       500044    163840.00
    1001.983     0.999995       500044    187245.71
    1001.983     0.999995       500044    218453.33
    1002.495     0.999996       500046    262144.00
    1002.495     1.000000       500046          inf
#[Mean    =        9.512, StdDeviation   =       58.254]
#[Max     =     1001.984, Total count    =       500046]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599968 requests in 1.00m, 38.91MB read
Requests/sec:   9999.61
Transfer/sec:    664.04KB